//=============================================================================
//
// フェード処理 [fade.h]
// Author : HIROYUKI KAWAHIGASHI
//
//=============================================================================
#ifndef _GAMEFADE_H_
#define _GAMEFADE_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// フェードの状態
//=============================================================================
typedef enum
{
	GAMEFADE_NONE = 0,		// 何もない状態
	GAMEFADE_IN,			// フェードイン処理
	GAMEFADE_TELOP,			// テロップ表示
	GAMEFADE_OUT,			// フェードアウト処理
	GAMEFADE_MAX
} GAMEFADE;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitGameFade(void);
void UninitGameFade(void);
void UpdateGameFade(void);
void DrawGameFade(void);

void SetGameFade(void);
GAMEFADE GetGameFade(void);

#endif