//========================================================================================
//
// polygon基礎[game.h]
//
// Author : masayasu wakita
// 07/18
//
//========================================================================================
#ifndef _GAME_H_
#define _GAME_H_

//========================================================================================
// インクルードファイル
//========================================================================================
#include "main.h"

//========================================================================================
// 構造体定義
//========================================================================================
typedef enum
{
	GAMESTATE_NONE = 0,				//何もしていない状態
	GAMESTATE_TUTORIAL,				//チュートリアル
	GAMESTATE_TUTORIALEND,			//チュートリアル終了
	GAMESTATE_NORMAL,				//通常状態
	GAMESTATE_PAUSE,				//ポーズ状態
	GAMESTATE_BREAK,				//ゲーム中断
	GAMESTATE_STAGECHANGE,			//ゲームチェンジ
	GAMESTATE_END,					//ゲーム終了状態
	GAMESTATE_MAX
} GAMESTATE;

//========================================================================================
// プロトタイプ宣言
//========================================================================================
void InitGame();
void UninitGame(void);
void UpdateGame(void);
void DrawGame(void);
void SetGameState(GAMESTATE state);
GAMESTATE GetGameState(void);
#endif