//=============================================================================
//
// ポリゴン処理 [magician.h]
// Author : masayasu wakita
//
//=============================================================================
#ifndef _MAGICIAN_H_
#define _MAGICIAN_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitMagician(void);
void UninitMagician(void);
void UpdateMagician(void);
void DrawMagician(void);
void SetMagician(D3DXVECTOR3 pos);
#endif