//========================================================================================
//
// polygon基礎[bg.h]
//
// Author : masayasu wakita
// 07/18
//
//========================================================================================
#ifndef _RESULT_H_
#define _RESULT_H_
//========================================================================================
// インクルードファイル
//========================================================================================
#include "main.h"

//=============================================================================
// 構造体定義
//=============================================================================
typedef enum
{
	RESULTSTATE_CLEAR = 0,
	RESULTSTATE_FAILD,
	RESULTSTATE_MAX
} RESULTSTATE;

//========================================================================================
// プロトタイプ宣言
//========================================================================================
void InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);
void SetVertexResult(int index, D3DXVECTOR3 pos, float fWidth, float fHeight);
void SetResultState(RESULTSTATE state);
#endif